fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перебор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.Обновление = Ложь;
	
	Для Каждого Строка из ОтпускаСотрудников Цикл
		
		ТочкаДиаграммы = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		ТочкаДиаграммы.Текст = Строка.Сотрудник;
		СерияДиаграммы = ДиаграммаГанта.УстановитьСерию("Отпуск");
		СерияДиаграммы.Текст = "Отпуск";
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаДиаграммы, СерияДиаграммы);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
